vehicle-PM-emission/0_org/PMroad
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      PMroad;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [ 0 0 0 0 0 0 0 ];
internalField uniform 0.0;

boundaryField
{
    ffminx
    {
        type fixedValue;
	value uniform 0.0;
    }

    ffmaxx
    {
        type            inletOutlet;
	phi		phi;
        value           uniform 0.0;
        inletValue      uniform 0.0;
    }

    ffminy
    {
        type slip;
    }

    ffmaxy
    {
        type slip;
    }

    ffminz
    {
        type fixedValue;
	value uniform 1.0;
    }

    ffmaxz
    {
        type slip;
    }

    body1
    {
        type zeroGradient;
    }

    "frontD.*"
    {
        type zeroGradient;
    }

    "rearD.*"
    {
        type zeroGradient;
    }

    "frontP.*"
    {
        type zeroGradient;
    }

    "rearP.*"
    {
        type zeroGradient;
    }

}
