vehicle-PM-emission/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [ 0 2 -2 0 0 0 0 ];
internalField uniform 3.375;

boundaryField
{
    ffminx
    {
        type fixedValue;
        value uniform 3.375;
    }

    ffmaxx
    {
        type zeroGradient;
    }

    ffminy
    {
        type slip;
    }

    ffmaxy
    {
        type slip;
    }

    ffminz
    {
        type kqRWallFunction;
        value uniform 3.375;
    }

    ffmaxz
    {
	type slip;
    }

    body1
    {
        type kqRWallFunction;
        value uniform 3.375;
    }

    "frontD.*"
    {
        type kqRWallFunction;
        value uniform 3.375;
    }

    "rearD.*"
    {
        type kqRWallFunction;
        value uniform 3.375;
    }

    "frontP.*"
    {
        type kqRWallFunction;
        value uniform 3.375;
    }

    "rearP.*"
    {
        type kqRWallFunction;
        value uniform 3.375;
    }

}
